'use client';

import { prefix } from '@/utils/prefix';
import Card from '../shared/Card';
import Pagination from '../ui/Pagination/Pagination';

const newsContent = [
  {
    id: 1,
    src: `${prefix}/news/news1.jpg`,
    title: 'Зустріч українців',
    text: '10 жовтня, відбулася зустріч представників української і проукраїнської громади цієї околиці Брукліна, НЙ з  найбільш впливовим сенатором-демократом Чаком Шумером. Його реакція на дії Путіна в Україні і, на терористичні атаки московських окупантів, здійснені у ці дні, була такою ж сповненою гніву, як кожного з нас українців. Підготовлені нами питання про визнання Росії – державою-терористом на офіційному рівні, про кваліфікацію воєнних злочинів Росії в Україні геноцидом, про надання ще більше зброї Україні знаходили глибоке розуміння і запевнення в тому, що  він, як справжній друг України, прикладе до цього всіх зусиль.v',
    link: '/news',
  },
  {
    id: 2,
    src: `${prefix}/news/news2.jpg`,
    title:
      'Український фестиваль втретє відбувся у Брукліні, в районі Брайтона',
    text: 'Першого червня відбувся наш фестиваль "Ангели тримають небо", зорганізований ВГО "Нова українська хвиля" та заснованою нашою організацією школою українознавства "Нова хвилька". ',
    link: '/news',
  },
  {
    id: 3,
    src: `${prefix}/news/news3.jpg`,
    title: 'Відзначення Дня Злуки в Українському Інституті Америки',
    text: 'Відзначення Дня Злуки в Українському Інституті Америки, в Нью Йорку, стало також доброю нагодою висловити вдячність Постійному Представникові України до ООН Сергію Кислиці за його вагомий внесок у боротьбі за Українські інтереси на дипломатичному фронті та за чудову співпрацю з громадою.',
    link: '/news',
  },
  {
    id: 4,
    src: `${prefix}/news/news1.jpg`,
    title: 'Зустріч українців Брукліна з сенатором Шумером',
    text: '10 жовтня, відбулася зустріч представників української і проукраїнської громади цієї околиці Брукліна, НЙ з  найбільш впливовим сенатором-демократом Чаком Шумером. Його реакція на дії Путіна в Україні і, на терористичні атаки московських окупантів, здійснені у ці дні, була такою ж сповненою гніву, як кожного з нас українців. Підготовлені нами питання про визнання Росії – державою-терористом на офіційному рівні, про кваліфікацію воєнних злочинів Росії в Україні геноцидом, про надання ще більше зброї Україні знаходили глибоке розуміння і запевнення в тому, що  він, як справжній друг України, прикладе до цього всіх зусиль.v',
    link: '/news',
  },
  {
    id: 5,
    src: `${prefix}/news/news2.jpg`,
    title:
      'Український фестиваль втретє відбувся у Брукліні, в районі Брайтона',
    text: 'Першого червня відбувся наш фестиваль "Ангели тримають небо", зорганізований ВГО "Нова українська хвиля" та заснованою нашою організацією школою українознавства "Нова хвилька". ',
    link: '/news',
  },
  {
    id: 6,
    src: `${prefix}/news/news3.jpg`,
    title: 'Відзначення Дня Злуки в Українському Інституті Америки',
    text: 'Відзначення Дня Злуки в Українському Інституті Америки, в Нью Йорку, стало також доброю нагодою висловити вдячність Постійному Представникові України до ООН Сергію Кислиці за його вагомий внесок у боротьбі за Українські інтереси на дипломатичному фронті та за чудову співпрацю з громадою.',
    link: '/news',
  },
  {
    id: 7,
    src: `${prefix}/news/news1.jpg`,
    title: 'Зустріч українців Брукліна з сенатором Шумером',
    text: '10 жовтня, відбулася зустріч представників української і проукраїнської громади цієї околиці Брукліна, НЙ з  найбільш впливовим сенатором-демократом Чаком Шумером. Його реакція на дії Путіна в Україні і, на терористичні атаки московських окупантів, здійснені у ці дні, була такою ж сповненою гніву, як кожного з нас українців. Підготовлені нами питання про визнання Росії – державою-терористом на офіційному рівні, про кваліфікацію воєнних злочинів Росії в Україні геноцидом, про надання ще більше зброї Україні знаходили глибоке розуміння і запевнення в тому, що  він, як справжній друг України, прикладе до цього всіх зусиль.v',
    link: '/news',
  },
  {
    id: 8,
    src: `${prefix}/news/news2.jpg`,
    title:
      'Український фестиваль втретє відбувся у Брукліні, в районі Брайтона',
    text: 'Першого червня відбувся наш фестиваль "Ангели тримають небо", зорганізований ВГО "Нова українська хвиля" та заснованою нашою організацією школою українознавства "Нова хвилька". ',
    link: '/news',
  },
  {
    id: 9,
    src: `${prefix}/news/news3.jpg`,
    title: 'Відзначення Дня Злуки в Українському Інституті Америки',
    text: 'Відзначення Дня Злуки в Українському Інституті Америки, в Нью Йорку, стало також доброю нагодою висловити вдячність Постійному Представникові України до ООН Сергію Кислиці за його вагомий внесок у боротьбі за Українські інтереси на дипломатичному фронті та за чудову співпрацю з громадою.',
    link: '/news',
  },
];

const NewsContent: React.FC = () => {
  return (
    <>
      <div className="newsBlocks">
        <div className="container px-4 mx-auto">
          <div className="flex flex-wrap mx-[-12px]">
            {newsContent.map(card => (
              <div
                className="my-4 px-[12px] w-full md:w-1/2 lg:w-1/3 newsBlock"
                key={card.id}
              >
                <Card
                  link={`/news/${card.id}`}
                  imageSrc={card.src}
                  title={card.title}
                  text={card.text}
                />
              </div>
            ))}
          </div>
        </div>
      </div>

      <Pagination />
    </>
  );
};

export default NewsContent;
