import NewsEvents from "@/components/home/NewsEvents";
import ProjectHeader from "@/components/projectsBlock/ProjectHeader";
import ProjectContent from "@/components/projectsBlock/ProjectContent";
import Quote from "@/components/quote/Quote";
import Hero from "@/components/ui/Hero";
import {heroData} from "@/data/projects/hero";
import { prefix } from "@/utils/prefix";


const projects = {
  schoolBlock: {
    id: 1,
    generalTitle: 'Школа Українознавства “Нова Хвилька”',
    contentTop: [
      {
        id: 1,
        title: 'Збереження ідентичності та виховання нового покоління',
        description: 'Школа українознавства "Нова хвилька", заснована у 2016 році, стала важливим осередком української культури в Америці. Від 60 дітей у перший рік існування вона зросла до 415 учнів у 2025 році. Це місце, де діти українського походження вивчають мову, історію та традиції, відчуваючи свою належність до українського народу, що бореться за свободу та демократію.',
        image: `${prefix}/projects/project1.png`
      },
      {
        id: 2,
        title: 'Освітній процес та культурне виховання',
        description: 'Навчання в школі розпочинається для дітей від 3 років у і триває до 17 років у випускному класі. Учні не лише здобувають знання, а й долучаються до творчої діяльності, беруть участь у волонтерських ініціативах, налагоджують дружні зв’язки з ровесниками з України, що сприяє розбудові та зміцненню зв’язків між молоддю. До викладання залучено понад 45 кваліфікованих педагогів та психологів. Заняття відбуваються щосуботи з 9:15 до 13:15. Набір учнів на новий навчальний рік розпочинається наприкінці травня.',
        image: `${prefix}/projects/project2.png`
      }
    ],
    contentBottom: [
      {
        id: 3,
        title: 'Виклики та місія школи',
        description: 'Швидка асиміляція в англомовному середовищі залишається викликом для українських дітей у США. Навіть ті, хто нещодавно приїхав, за короткий час починають спілкуватися англійською. "Нова хвилька" допомагає зберегти рідну мову та культурну ідентичність, створюючи атмосферу рідного дому для дітей, які вимушено покинули Україну через війну.',
        image: `${prefix}/projects/project3.png`,
        linkSchool: 'https://newwaveschool.org/',
        linkFb: 'https://www.facebook.com/novakhvylka'
      },
      {
        id: 4,
        title: 'Громадська та волонтерська діяльність',
        checkList: [
          {
            id: 1,
            title: 'Організовуємо, проводимо та здійснюємо щорічний український фестиваль у Брукліні, що збирає понад 1,000 відвідувачів.'
          },
          {
            id: 2,
            title: 'Здійснюєм збір коштів на підтримку українських військових, дітей Героїв, поранених воїнів та переселенців.'
          },
          {
            id: 3,
            title: 'Проводим інформаційні ярмарки та заходи для соціальної та психологічної адаптації новоприбулих українців.'
          },
          {
            id: 4,
            title: 'Підтримуємо зв’язок з американськими політиками та адвокуємо інтереси України в США.'
          }
        ],
        image: `${prefix}/projects/project4.png`
      }
    ],
  },
  quote: '“Немає більшого скарбу, який маємо передати нашим дітям та онукам, аніж знання та усвідомлення своєї приналежності до роду і народу, який береже свою мову та культурні традицїї”.',
  projectsContent: [
    {
      id: 2,
      generalTitle: 'Проєкт – Український Освітньо-Культурний Інформаційний Центр',
      content: [
        {
          id: 1,
          title: 'Український центр у Брукліні – осередок єдності',
          description: 'Успішна й організована українська громада є запорукою зростання кожного її члена та розвитку українських інституцій у США. “Нова Українська Хвиля” ініціює створення Українського інформаційно-культурного центру в Брукліні, де проживає велика кількість українців. Це багатокультурне місто потребує власних українських осередків, щоб зберегти національну ідентичність та протистояти впливу російськомовного середовища.',
          image: `${prefix}/projects/project5.png`,
        },
        {
          id: 2,
          title: 'Збереження культури та традицій',
          description: 'Ми прагнемо примножувати українську культурну спадщину в діаспорі США, створюючи простору для зустрічей, обговорень та реалізації спільних проєктів. Ми хочемо зміцнити громаду через збереження мови, традицій і звичаїв, а також через формування національної єдності, незалежно від місця проживання. Будуємо Україну всюди, де ми є!',
          image: `${prefix}/projects/project6.png`,
        },
        {
          id: 3,
          title: 'Соціально-інформаційна політика є важливою складовою',
          description: 'Соціально-інформаційні заходи для різних вікових категорій, особливо в час, коли багато біженців з України шукають можливості інтегруватися у нове незнайоме для них середовище є надзвичайно важливими для української громади. Події відкриті для широкого кола зацікавлених з різних національних та етнічних спільнот.',
          image: `${prefix}/projects/project7.png`,
        },
        {
          id: 4,
          title: 'Створюємо простір для зустрічей з політиками задля підтримки України',
          description: 'Зустрічі з американськими політиками – народна дипломатія – ще одна ділянка нашої активної діяльності, яка сприяє налагодженню контактів задля поширення інформації про Україну, підтримку її на міжнародному рівні та лобіювання інтересів громади на місцевому рівні. Свій центр – як майданчик для такої співпраці – один із першочергових проєктів. ',
          image: `${prefix}/projects/project8.png`,
        },
        {
          id: 5,
          title: 'Щоденний дитячий садочок – мрія української громади',
          description: 'Російсько-мовне середовище у Брукліні, починаючи з дитячих дошкільних закладів наздоганяє українців навіть в Америці. Відкриття щоденного дитячого садочка з можливістю спілкування українською стане можливим у своєму Освітньо-Культурному Інформаційному Центрі.',
          image: `${prefix}/projects/project9.png`,
        }
      ]
    },
    {
      id: 3,
      generalTitle: 'Проєкт –“Мистецтво і Перемога”',
      content: [
        {
          id: 1,
          title: "Об’єднуємо мистецтво та волонтерство",
          description: '"Мистецтво і Перемога" — це ініціатива нашої української громади у США, яка поєднує культуру, волонтерство та адвокацію, аби підтримати Україну в боротьбі за свободу. Ми організовуємо культурні події, фестивалі та благодійні збори, залучаємо американське суспільство до української справи та спрямовуємо зібрані кошти на допомогу військовим, переселенцям і дітям Героїв.',
          image: `${prefix}/projects/project10.png`,
        },
        {
          id: 2,
          title: 'Культурні заходи на підтримку України',
          image: `${prefix}/projects/project11.png`,
          checkList: [
            {
              id: 1,
              title: 'Організовуємо щорічний український фестиваль у Брукліні, який збирає понад 1,000 відвідувачів.'
            },
            {
              id: 2,
              title: 'Проводимо кінопокази, зустрічі з митцями, концерти та аукціони для збору коштів на допомогу українцям.'
            },
            {
              id: 3,
              title: 'Популяризуємо українську культуру через музику, танці, традиційну кухню та мистецькі події.'
            }
          ]
        },
        {
          id: 3,
          title: 'Гуманітарна допомога',
          image: `${prefix}/projects/project12.png`,
          checkList: [
            {
              id: 1,
              title: 'Закуповуємо та надсилаємо аптечки, ліки, безпілотники та засоби захисту для військових.'
            },
            {
              id: 2,
              title: 'Забезпечуємо підтримку дітям Героїв, пораненим воїнам, переселенцям та українським біженцям.'
            },
            {
              id: 3,
              title: 'Організовуємо інформаційні заходи для адаптації новоприбулих у США.'
            }
          ]
        },
        {
          id: 4,
          title: 'Адвокація та популяризація України',
          image: `${prefix}/projects/project13.png`,
          checkList: [
            {
              id: 1,
              title: 'Поширюємо інформацію про Україну в американському суспільстві.'
            },
            {
              id: 2,
              title: 'Встановлюємо контакти з американськими політиками для адвокації українських інтересів.'
            },
            {
              id: 3,
              title: 'Співпрацюємо з іншими організаціями для забезпечення довгострокової підтримки України.'
            }
          ]
        }
      ]
    }
  ]
};

const quote = projects.quote;

const ProjectsPage = () => {
  return (
    <div className="ProjectsPage">
      <Hero data={heroData} />
      {
        projects.schoolBlock.generalTitle && (
          <ProjectHeader title={projects.schoolBlock.generalTitle } className="!mb-0" />
        )
      }
      <ProjectContent contentBlock={projects.schoolBlock.contentTop} />
      <div className="container mx-auto px-4">
        <Quote quote={quote} className="text-font-primary"/>
      </div>
      <div className="mb-6">
        <ProjectContent contentBlock={projects.schoolBlock.contentBottom} />
      </div>
      <div className="mb-6">
        <NewsEvents textLink="Всі новини школи" link="" titleEvents="Новини та події школи" />
      </div>
      {projects.projectsContent.map(item => {
        const title = item.generalTitle;
        return (
          <div key={item.id}>
            <ProjectHeader title={title} />
            <ProjectContent contentBlock={item.content} />
          </div>
        );
      })

      }
    </div>
  );
};

export default ProjectsPage;
