const joinCommunityData = {
  uk: {
    title: 'Як долучитися до нас',
    items: [
      {
        title: 'Волонтерство',
        description: 'Допоможіть нам організовувати заходи, проводити майстер-класи чи підтримувати технічну сторону подій. Ваші вміння та ентузіазм завжди потрібні!'
      },
      {
        title: 'Участь у заходах',
        description: 'Відвідуйте наші виставки, лекції, майстер-класи та культурні вечори. Ви зможете не лише дізнатися більше про українську культуру, але й долучитися до творчої спільноти'
      },
      {
        title: 'Творчі ініціативи',
        description: 'Маєте цікаву ідею або проєкт? Поділіться з нами, і ми допоможемо втілити його в життя - ми відкриті до співпраці з митцями, викладачами та культурними діячами'
      }
    ]
  }
};

export { joinCommunityData };
